[
  {
    "title": "InfoDynamics",
    "year": "2024",
    "skills": ["React", "GraphQL", "Hasura", "UX/UI"],
    "thumbnail": "/images/project_infodynamics.jpeg",
    "images": ["/images/project_infodynamics.jpeg"],
    "subtitle": "Meter data analytics and billing SaaS platform",
    "description": "A SaaS portal for meter data analytics and billing functionality.",
    "fullDescription": "InfoDynamics is a scalable SaaS platform that enables utility companies to visualize, analyze, and bill for meter data through a clean, modern web interface. Built with React, Hasura GraphQL, and a UX-first approach."
  },
  {
    "title": "HazChat",
    "year": "2023",
    "skills": ["Swift", "SwiftUI", "SQLite", "AWS"],
    "thumbnail": "/images/project_hazchat.jpeg",
    "images": ["/images/project_hazchat.jpeg"],
    "subtitle": "Enterprise iOS communication app",
    "description": "An iOS enterprise application for workplace communication.",
    "fullDescription": "HazChat is an enterprise iOS app designed for real-time workplace communication with built-in safety features. Built with Swift, SwiftUI, and SQLite, with AWS integration for cloud synchronization."
  },
  {
    "title": "PolyPortal",
    "year": "2023",
    "skills": ["Unity", "AWS", "3D Modeling"],
    "thumbnail": "/images/polyportal-thumbnail.jpg",
    "images": ["/images/polyportal-thumbnail.jpg"],
    "subtitle": "3D model viewing in the cloud",
    "description": "A proof-of-concept app for viewing internal 3D models on AWS cloud infrastructure.",
    "fullDescription": "PolyPortal was a proof-of-concept app built with Unity and AWS to allow internal teams to view and interact with 3D models in a secure cloud-hosted environment. Aimed at improving asset visualization for technical teams."
  },
  {
    "title": "GeoAlarms Product",
    "year": "2024",
    "skills": ["Python", "Kafka", "Data Analytics"],
    "thumbnail": "/images/geoalarms-thumbnail.jpg",
    "images": ["/images/geoalarms-thumbnail.jpg"],
    "subtitle": "Advanced meter alarms and outage analytics",
    "description": "A meter alarms product developed in collaboration with an Australian DNSP.",
    "fullDescription": "GeoAlarms is an advanced meter alarm and outage analytics system developed in collaboration with an Australian DNSP. It integrates Kafka-based messaging with Python analytics pipelines to deliver near real-time network fault detection."
  },
  {
    "title": "Meter Data Analytics Platform",
    "year": "2022",
    "skills": ["Python", "PySpark", "Databricks"],
    "thumbnail": "/images/meter-data-thumbnail.jpg",
    "images": ["/images/meter-data-thumbnail.jpg"],
    "subtitle": "Big data analytics for smart meter data",
    "description": "A data analytics solution for meter data using Databricks and MLflow.",
    "fullDescription": "This platform processes and analyzes large-scale smart meter datasets using Databricks, PySpark, and MLflow. It enables energy retailers and network operators to gain insights into customer usage and optimize demand forecasting."
  },
  {
    "title": "daste.website",
    "year": "2025",
    "skills": ["React", "Cloudflare"],
    "thumbnail": "/images/project_daste-website.png",
    "images": ["/images/project_daste-website.png"],
    "subtitle": "Official band website",
    "description": "The official website for my band daste., hosted on Cloudflare infrastructure.",
    "fullDescription": "The official web presence for my band daste., designed and developed in React, hosted via Cloudflare Pages for high availability and fast global delivery. Features include embedded tour dates, music embeds, and press kits."
  },
  {
    "title": "Rehearsal Studio App",
    "year": "2025",
    "skills": ["React", "Audio Processing", "Web Audio API"],
    "thumbnail": "/images/rehearsal-studio-thumbnail.jpg",
    "images": ["/images/rehearsal-studio-thumbnail.jpg"],
    "subtitle": "Practice and rehearsal tool for musicians",
    "description": "A React-based web application for musicians to upload stems, assign them to band members, and create custom practice mixes.",
    "fullDescription": "The Rehearsal Studio App lets musicians upload individual audio stems, assign parts to players, and create custom mixes for practicing. Built with React and the Web Audio API, it simplifies the rehearsal process for bands and music educators."
  }
]