{
    "bio": "Innovative and technically proficient Developer and Product Specialist with experience managing and developing technology products. Strong background in application development, AI, cloud computing, and data science. Hands-on expertise in Python, Swift, Unity, Xcode, C#, and cloud-based development/infrastructure using AWS. Passionate about the intersection of creativity and logical thinking.",
    "experience": [
      {
        "stringDate": "December 2024 – Current",
        "startDate": "2024-12",
        "endDate": null,
        "title": "Product & Innovation – Product Specialist / Developer",
        "description": "Led UX/UI design, wireframing, and customer engagement for transitioning software into a SaaS portal. Performed data analytics using Python to identify customer segments and uncover key insights from meter data. Developed the InfoDynamics Renew project, integrating billing functionality leveraging GraphQL through Hasura."
      },
      {
        "stringDate": "March 2024 – November 2024",
        "startDate": "2024-03",
        "endDate": "2024-11",
        "title": "Product & Innovation – Product Data Scientist",
        "description": "Delivered a data analytics report using Python to prove a hypothesis about inrush current and outage duration. Developed the GeoAlarms product concept and backend with Python and Kafka through collaboration with an Australian Distribution Network Service Provider (DNSP)."
      },
      {
        "stringDate": "August 2023 – February 2024",
        "startDate": "2023-08",
        "endDate": "2024-02",
        "title": "Product & Innovation – Product Specialist / Developer",
        "description": "Key contributor to prototype development of GeoAlarms using Python & Kafka. Developed proof-of-concept API-based load management interfaces for load control products using React/JavaScript. Created software with Python to retrieve FCAS data from Kafka and output CSVs."
      },
      {
        "stringDate": "February 2023 – August 2023",
        "startDate": "2023-02",
        "endDate": "2023-08",
        "title": "Emerging Technologies – 3D Modelling Artist/Sound Designer",
        "description": "Contributed to the development of a Unity mobile game for electrical safety awareness. Created 3D models using Blender and textures with Adobe Substance 3D. Scripted game functionality using C# and integrated with Unity game objects."
      },
      {
        "stringDate": "August 2022 – February 2023",
        "startDate": "2022-08",
        "endDate": "2023-02",
        "title": "Mobile Applications Platform – Junior Application Developer",
        "description": "Contributed to a major update for the iOS enterprise application HazChat. Developed using Swift and SwiftUI, created a local app database with SQLite, and integrated cloud services in AWS."
      },
      {
        "stringDate": "February 2022 – August 2022",
        "startDate": "2022-02",
        "endDate": "2022-08",
        "title": "Data Science – Data Science Specialist",
        "description": "Contributed to the development of the Meter Data Analytics solution in Databricks using Python and PySpark. Produced an inference pipeline for machine learning models using MLflow. Created dashboards and visualizations to show customer segment breakdowns."
      }
    ],
    "education": [
      {
        "stringDate": "2018 – 2021",
        "startDate": "2018-01",
        "endDate": "2021-12",
        "institution": "Griffith University",
        "degree": "Bachelor of Intelligent Digital Technologies",
        "description": "Majored in Internet of Things and Robotics. Graduated with a GPA of 5.6 and received the Griffith Award for Academic Excellence in the final year. Focused on fields such as robotics, IoT, app/web development, big data analytics, VR, and AR."
      }
    ],
    "additionalExperience": [
      {
        "title": "Artist and Producer",
        "description": "Part of the project 'daste.' with over 40 million streams across Spotify, Apple Music, YouTube, and SoundCloud. Managed social media accounts, marketing campaigns, and logistics for tours. Designed graphics for videos, artwork, and promotional materials."
      },
      {
        "title": "Design and Creative Applications",
        "description": "Proficient in Adobe Creative Suite (Illustrator, Photoshop, After Effects, Premiere Pro, InDesign). Experienced in creating wireframes and prototypes using Figma. Skilled in audio production and songwriting using Ableton and Logic Pro."
      }
    ]
  }